Revit 2027 API
BumpMap.BumpmapBitmap Property
 The property labeled "Source" from the "BumpMap" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string BumpmapBitmap { get; }
Public Shared ReadOnly Property BumpmapBitmap As String
	Get
public:
static property String^ BumpmapBitmap {
	String^ get ();
}
static member BumpmapBitmap : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyString" and will contain a relative path.
See Also
Reference
BumpMap Class
Autodesk.Revit.DB.Visual Namespace